# tap
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
cask_args appdir: "/Applications"

tap "brewsci/science"
tap "caskroom/cask"
tap "delphinus/sfmono-square"
tap "heroku/brew"
tap "iyuuya/jimakun"
tap "mscharley/homebrew"
tap "nektos/tap"
tap "neovim/neovim"
tap "sanemat/font"
tap "tkengo/highway"
tap "universal-ctags/universal-ctags"

cask "xquartz"

brew "mas"

brew "readline"
brew "libffi"
brew "pkg-config"
brew "pcre"
brew "pcre2"
brew "automake"
brew "libtool"

brew "openssl"
brew "curl"
brew "boost"
brew "w3m"
brew "universal-ctags"
brew "gnu-sed"

# for PHP
brew "libevent"
brew "jpeg"
brew "openjpeg"
brew "libpng"
brew "mcrypt"
brew "libxml2"
brew "lemon"
brew "re2c"

brew "git"
brew "git-cal"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "git-now"
brew "hub"
brew "tig"
brew "gibo"
brew "gpg"

brew "tree"
brew "zsh"
brew "zsh-completions"
brew "reattach-to-user-namespace"
brew "tmux"
brew "pv"
brew "global"
brew "nmap"
brew "jq"
brew "the_silver_searcher"
brew "rg"
brew "fzf"
brew "asciidoc"
brew "source-highlight"
brew "ccat"
brew "colordiff"
brew "dfc"
brew "direnv"

brew "cairo"
brew "pango"
brew "freetype"
brew "fontforge"
# brew "graphviz", args: ["with-freetype"]
brew "ghostscript"
# brew "imagemagick@6", link: true, args: ["with-fontconfig", "with-ghostscript", "with-librsvg", "with-little-cms2", "with-openjpeg", "with-pango", "with-webp"]
brew "qt"
# brew "qt@5.5", link: true

brew "mycli"
brew "mysql"
brew "postgresql"
brew "sqlite"
brew "redis"

brew "neovim"
brew "macvim", args: [
  "with-lua",
  "with-luajit",
  "with-python3"
]
# brew "emacs", args: [
#   "with-cocoa",
#   "with-ctags",
#   "with-dbus",
#   "with-gnutls",
#   "with-imagemagick@6",
#   "with-librsvg",
#   "with-mailutils",
#   "with-modules"
# ]

# science
brew "r"

brew "packer"
brew "cmatrix"

brew "ansible"

brew "libyaml"
brew "gdbm"
brew "docbook"
brew "docbook-xsl"
brew "bdw-gc"
brew "gettext"
brew "pixman"
brew "cmake"
brew "zeromq"
brew "czmq"
brew "wxmac"
brew "erlang"
brew "elixir"
brew "ffmpeg"
brew "gobject-introspection"
brew "icu4c"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "geckodriver"
brew "heroku"
brew "xz"
brew "jbig2dec"
brew "oniguruma"
brew "libgit2"
brew "libiconv"
brew "libmagic"
brew "librsvg"
brew "libsodium"
brew "libsvg"
brew "libsvg-cairo"
brew "libxslt"
brew "mhash"
brew "mono"
brew "ncurses"
brew "nkf"
brew "poppler"
brew "pdf2svg"
brew "scons"
brew "shellcheck"
brew "subversion"
brew "terminal-notifier"
brew "unar"
brew "unixodbc"
brew "unoconv"
brew "watchman"
brew "yarn"
# tap "sanemat/font"
# brew "sanemat/font/ricty"
brew "octave"
brew "sourcekitten"

# cask "iterm2"
cask "evernote"
cask "firefox"
cask "google-chrome"
cask "keycastr"
cask "licecap"
cask "linein"
cask "sequel-pro"
cask "shoes"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "vlc"
cask "wireshark"
cask "dropbox"

cask "slack"

cask "macpass"

cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"



brew "act"
brew "adns"
brew "aom"
brew "apr"
brew "apr-util"
brew "arpack"
brew "aws-shell"
brew "awscli"
brew "bison"
brew "brotli"
brew "c-ares"
brew "carthage"
brew "cscope"
brew "csfml"
brew "doxygen"
brew "editorconfig"
brew "eigen"
brew "elinks"
brew "embulk"
brew "epstool"
brew "fig2dev"
brew "flac"
brew "fltk"
brew "fontconfig"
brew "frei0r"
brew "fribidi"
brew "fswatch"
brew "fx"
brew "gd"
brew "gdk-pixbuf"
brew "ghc"
brew "ghostscript"
brew "ghq"
brew "giflib"
brew "gifsicle"
brew "git-quick-stats"
brew "git-subrepo"
brew "gitleaks"
brew "gl2ps"
brew "glfw"
brew "glib"
brew "glpk"
brew "gmp"
brew "gnu-getopt"
brew "gnu-tar"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "gperftools"
brew "graphicsmagick"
brew "graphite2"
brew "graphviz"
brew "grep"
brew "gtk-doc"
brew "gts"
brew "harfbuzz"
brew "hdf5"
brew "heroku"
brew "heroku-node"
brew "highlight"
brew "highway"
brew "htop"
brew "httpd"
brew "hubflow"
brew "hwloc"
brew "icu4c"
brew "ilmbase"
brew "imagemagick"
brew "isl"
brew "jansson"
brew "jasper"
brew "jbig2dec"
brew "jemalloc"
brew "kpcli"
brew "lame"
brew "ldns"
brew "leptonica"
brew "lftp"
brew "libass"
brew "libassuan"
brew "libbluray"
brew "libcerf"
brew "libcroco"
brew "libde265"
brew "libev"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "libmodplug"
brew "libogg"
brew "libomp"
brew "libsamplerate"
brew "libsndfile"
brew "libsoxr"
brew "libspiro"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libuninameslist"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libxslt"
brew "libyaml"
brew "little-cms"
brew "little-cms2"
brew "llvm@4"
brew "lua"
brew "luajit"
brew "lynx"
brew "lz4"
brew "lzo"
brew "make"
brew "media-info"
brew "metis"
brew "mpfr"
brew "msgpack"
brew "neovim"
brew "netpbm"
brew "nettle"
brew "nghttp2"
brew "nginx"
brew "node"
brew "npth"
brew "nspr"
brew "nss"
brew "numpy"
brew "open-mpi"
brew "openblas"
brew "opencore-amr"
brew "openexr"
brew "openssh"
brew "opus"
brew "p11-kit"
brew "pdf2svg"
brew "perl"
brew "pinentry"
brew "pixman"
brew "plantuml"
brew "plotutils"
brew "poppler"
brew "portaudio"
brew "pstoedit"
brew "pwgen"
brew "python"
brew "python3"
brew "python@2"
brew "qhull"
brew "qrupdate"
brew "ranger"
brew "ricty"
brew "ripgrep"
brew "rsync"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "rust"
brew "scons"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_net"
brew "sdl2_ttf"
brew "sfml"
brew "sfmono-square"
brew "shared-mime-info"
brew "snappy"
brew "speex"
brew "sslscan"
brew "suite-sparse"
brew "szip"
brew "tbb"
brew "terminal-notifier"
brew "tesseract"
brew "theora"
brew "unar"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "unoconv"
brew "utf8proc"
brew "veclibfort"
brew "vim"
brew "webp"
brew "x264"
brew "x265"
brew "xvid"
brew "yq"

cask "bdash"
cask "dash"
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "hammerspoon"
cask "karabiner-elements"
cask "macpass"
cask "mono-mdk"
cask "sequel-pro"
cask "skitch"
cask "vagrant"
cask "visual-studio-code"
cask "jasper"

mas 'Things', id: 904280696
