# tap
tap "heroku/brew"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/science"
tap "caskroom/cask"
tap "sanemat/font"
tap "neovim/neovim"

cask "xquartz"

brew "readline"
brew "libffi"
brew "pkg-config"
brew "pcre"
brew "automake"
brew "libtool"
brew "autoconf"

brew "openssl"
brew "curl", args: ["with-openssl"]
brew "boost"
brew "w3m"
brew "ctags"
brew "gnu-sed"

# for PHP
brew "libevent"
brew "jpeg"
brew "openjpeg"
brew "libpng"
brew "mcrypt"
brew "libxml2"
brew "lemon"
brew "re2c"

brew "git", args: ["with-curl", "with-gettext", "with-openssl", "with-pcre2"]
brew "git-cal"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "git-now"
brew "hub"
brew "tig"
brew "gibo"

brew "tree"
brew "zsh", args: ["without-etcdir"]
brew "zsh-completions"
brew "bash"
brew "fish"
brew "reattach-to-user-namespace"
brew "tmux"
brew "pv"
brew "global"
brew "nmap"
brew "jq"
brew "the_silver_searcher"
brew "fzf"
brew "asciidoc"
brew "source-highlight"
brew "ccat"
brew "colordiff"
brew "dfc"

brew "cairo"
brew "pango"
brew "freetype"
brew "fontforge"
brew "graphviz", args: ["with-freetype"]
brew "ghostscript"
brew "imagemagick@6", link: true, args: ["with-fontconfig", "with-ghostscript", "with-librsvg", "with-little-cms2", "with-openjpeg", "with-pango", "with-webp"]
brew "qt"
brew "qt@5.5", link: true

brew "mycli"
brew "mysql", restart_service: true
brew "mysql@5.6"
brew "postgresql", restart_service: true
brew "sqlite"
brew "redis", restart_service: true

brew "neovim"
brew "macvim", args: [
  "with-lua",
  "with-luajit",
  "with-python3"
]
brew "emacs", args: [
  "with-cocoa",
  "with-ctags",
  "with-dbus",
  "with-gnutls",
  "with-imagemagick@6",
  "with-librsvg",
  "with-mailutils",
  "with-modules"
]

# science
brew "r"

brew "packer"
brew "cmatrix"

brew "ansible"

brew "libyaml"
brew "gdbm"
brew "docbook"
brew "bdw-gc"
brew "gettext"
brew "pixman"
brew "chromedriver"
brew "cmake"
brew "zeromq"
brew "czmq"
brew "wxmac"
brew "erlang"
brew "elixir"
brew "ffmpeg"
brew "gobject-introspection"
brew "icu4c"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "geckodriver"
brew "global"
brew "heroku"
brew "xz"
brew "jbig2dec"
brew "oniguruma"
brew "libgit2"
brew "libiconv"
brew "libmagic"
brew "librsvg"
brew "libsodium"
brew "libsvg"
brew "libsvg-cairo"
brew "libxslt"
brew "mhash"
brew "mono"
brew "ncurses"
brew "nkf"
brew "poppler"
brew "pdf2svg"
brew "scons"
brew "shellcheck"
brew "subversion"
brew "terminal-notifier"
brew "unar"
brew "unixodbc"
brew "unoconv"
brew "watchman"
brew "yarn"
brew "sanemat/font/ricty"
brew "octave"

# cask "atom"
cask "iterm2"
cask "blender"
cask "evernote"
cask "firefox"
cask "google-chrome"
cask "flip4mac"
cask "franz"
cask "gimp"
cask "inkscape"
cask "keycastr"
cask "licecap"
cask "limechat"
cask "linein"
# cask "pg-commander"
cask "rdm"
cask "sequel-pro"
cask "shoes"
cask "skitch"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "wireshark"
cask "dropbox"
# cask "github"

# cask "butter"
# cask "gitter"
# cask "hipchat"
# cask "skype"
# cask "slack"

cask "macpass"
cask "gitify"

# vim: ft=conf
